#include <iostream>

using namespace std;

int main() {
    int n;

    // Внесуваме број на елементи во низата
    cout << "Внеси број на елементи: ";
    cin >> n;

    int arr[n];

    // Внесуваме елементи во низата
    cout << "Внеси " << n << " елементи: ";
    for (int i = 0; i < n; i++) {
        cin >> arr[i];
    }

    bool duplicateRemoved = false;  // Индикатор за тоа дали сме го избришале првиот дупликат

    // Пребарување од десно кон лево
    for (int i = n - 1; i >= 0; i--) {
        for (int j = i - 1; j >= 0; j--) {
            if (arr[i] == arr[j]) {
                // Ако најдеме дупликат и првиот дупликат уште не е избришан
                if (!duplicateRemoved) {
                    // Превиткуваме елементите во низата за да го избришеме првиот дупликат
                    for (int k = i; k < n - 1; k++) {
                        arr[k] = arr[k + 1];
                    }
                    n--;  // Намалуваме големината на низата
                    duplicateRemoved = true;  // Обележуваме дека сме го избришале првиот дупликат
                }
                break;  // Излегуваме од вложената пета кога ќе го најдеме првиот дупликат
            }
        }
        if (duplicateRemoved) {
            break;  // Престануваме со понатамошно пребарување откако ќе го избришеме првиот дупликат
        }
    }

    // Извеждаме ја новата низа
    cout << "Нова низа: ";
    for (int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    return 0;
}